Instance origin does not lie on host face. Instance will lose association to host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InstOutsideFaceBoundary { get; }
  Visual Basic
Public Shared ReadOnly Property InstOutsideFaceBoundary As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InstOutsideFaceBoundary {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace